Documents/ОтчетКомитентуОПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтчетКомитентуОПродажах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтчетКомитентуОПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДСВознаграждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭТ_ДоговорТО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДСВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Покупатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументРасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЭТ_КомиссияТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЭТ_КомиссияТО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МетодРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭТ_КомиссияТО_МетодРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорТО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АгентскиеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОтчетКомитентуОПродажах/Forms/ФормаДокументаОПродажах/Ext/Form/Module.bsl
//&НаКлиенте
//Процедура ЭТ_ЗаполнитьЗаПериодВместо(Команда)      
//	
//	ЗначенияЗаполнения = Новый Структура("Организация,Контрагент", Объект.Организация,Объект.Контрагент);             
//	Оп = Новый ОписаниеОповещения("ЭТ_ЗаполнитьТаблицу",ЭтотОбъект);
//	ОткрытьФорму("Документ.ОтчетКомитентуОПродажах.Форма.ЭТ_ЗаполнитьЗаПериорд", ЗначенияЗаполнения,ЭтаФорма, Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//КонецПроцедуры

// Обработчик события описания оповещения (получение результата)
&НаКлиенте
Процедура ЭТ_ЗаполнитьТаблицу(Результат,ДополнительныеПараметры) ЭКСПОРТ
    // Проверяем наличие результата
    Если Результат=КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;

    // Извлекаем параметры
    Организация = Результат.Организация;
    Контрагент = Результат.Контрагент;
    ВыбПериод = Результат.ВыбПериод; 
	//ТипДаты = Результат.ТипДаты; 
	
	ПолучитьСписокДоговоровТО(Организация,Контрагент,ВыбПериод);   
	ЗаполнитьОтражениеВУСН(ЭтаФорма);	
	ЗаполнитьДобавленныеКолонкиТаблиц();	
	ОбновитьИтоги(ЭтаФорма);        
	КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокДоговоровТО(Организация,Контрагент,ВыбПериод)    
	Объект.Товары.Очистить();
	КВозврату = Новый Массив;
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//	|ГДЕ
	//	|	ДоговорыКонтрагентов.Владелец = &Владелец
	//	|	И ДоговорыКонтрагентов.Организация = &Организация
	//	|	И ДоговорыКонтрагентов.";
	//
	//Если ТипДаты = Перечисления.ЭТ_ТипДаты.ДатаНачалаТура Тогда
	//	Запрос.Текст = Запрос.Текст + "ДатаНачала";
	//ИначеЕсли ТипДаты = Перечисления.ЭТ_ТипДаты.ДатаОкончанияТура Тогда
	//	Запрос.Текст = Запрос.Текст + "ДатаОкончания";		
	//Иначе
	//	Запрос.Текст = Запрос.Текст + "Дата";
	//КонецЕсли;
	//
	//Запрос.Текст = Запрос.Текст + " МЕЖДУ &Дата1 И &Дата2";
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугАгентскиеУслуги.Номенклатура КАК Номенклатура,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Содержание КАК Содержание,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Количество КАК Количество,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Цена КАК Цена,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма КАК Сумма,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Цена КАК ЦенаПоступления,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Сумма КАК СуммаПоступления,
	               |	РеализацияТоваровУслугАгентскиеУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	РеализацияТоваровУслугАгентскиеУслуги.СуммаНДС КАК СуммаНДС,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Контрагент КАК Контрагент,
	               |	РеализацияТоваровУслугАгентскиеУслуги.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Контрагент КАК Покупатель,
	               |	РеализацияТоваровУслугАгентскиеУслуги.Ссылка КАК ДокументРасчетов
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК РеализацияТоваровУслугАгентскиеУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугАгентскиеУслуги.ДоговорКонтрагента.Владелец = &Владелец
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	               |	И РеализацияТоваровУслугАгентскиеУслуги.Ссылка.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Дата1", ВыбПериод.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", ВыбПериод.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Объект.Товары.Загрузить(РезультатЗапроса.Выгрузить());

	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.Товары.Добавить();
	    НовСтр.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
	    НовСтр.Содержание = ВыборкаДетальныеЗаписи.Содержание; 
	    НовСтр.Количество = ВыборкаДетальныеЗаписи.Количество;
	    НовСтр.Цена = ВыборкаДетальныеЗаписи.Цена;
	    НовСтр.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	    НовСтр.ЦенаПоступления = ВыборкаДетальныеЗаписи.ЦенаПоступления;
	    НовСтр.СуммаПоступления = ВыборкаДетальныеЗаписи.СуммаПоступления;
	    НовСтр.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
	    НовСтр.СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДС;
	    НовСтр.ДокументРасчетов = ВыборкаДетальныеЗаписи.ДокументРасчетов;
	    НовСтр.Покупатель = ВыборкаДетальныеЗаписи.Покупатель;		
		Комиссия = РегистрыСведений.ЭТ_КомиссияТО.ПолучитьСуммуКомиссииТО(ВыборкаДетальныеЗаписи.ДоговорКонтрагента,ВыборкаДетальныеЗаписи.СуммаПоступления);
		НовСтр.СуммаВознаграждения = Комиссия.СуммаКомиссии;     
		НДС= ЭТ_ОбщийМодуль2.ПолучитьСуммуНДС(Комиссия.СуммаКомиссии,ТекущаяДата(),ВыборкаДетальныеЗаписи.ДоговорКонтрагента.Организация);
		НовСтр.СуммаНДСВознаграждения = НДС.Сумма;
		НовСтр.ЭТ_ДоговорТО = ВыборкаДетальныеЗаписи.ДоговорКонтрагента;
		
		
		//НовСтр.ДоговорКонтрагента = ВыборкаДетальныеЗаписи.ДоговорКонтрагента;

	//	
	////	КВозврату.Вставить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла; 
    ДобавленоПоДокументу = 0;
	Объект.ДенежныеСредства.Очистить();
	Для Каждого СтрТовар Из Объект.Товары Цикл
		
		Если Не ЗначениеЗаполнено(СтрТовар.ДокументРасчетов) Тогда
			Продолжить;
 		КонецЕсли;
		
		Если ТипЗнч(СтрТовар.ДокументРасчетов) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Продолжить;
		КонецЕсли;
		
		РеалСсылка = СтрТовар.ДокументРасчетов;
		
		Попытка
			РеалОбъект = РеалСсылка.ПолучитьОбъект();
		Исключение
			ОшибокДок = ОшибокДок + 1;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось получить объект Реализации "
				+ Строка(РеалСсылка) + " (для " + Строка(Объект) + "): "
				+ ОписаниеОшибки();
			Сообщение.Сообщить();
			
			Продолжить;
		КонецПопытки;
		
		ДоговорРеал = РеалОбъект.ДоговорКонтрагента;
		Покупатель  = РеалОбъект.Контрагент;
		
		Если Не ЗначениеЗаполнено(ДоговорРеал) Тогда
			Продолжить;
		КонецЕсли;
		
		// --- Выборка оплат по данному договору из КУДиР ---
		ЗапросОплаты = Новый Запрос;
		ЗапросОплаты.Текст =
		"ВЫБРАТЬ
		|	КнигаУчетаДоходовИРасходов.Период КАК ДатаПлатежа,
		|	КнигаУчетаДоходовИРасходов.Регистратор.Контрагент КАК Контрагент,
		|	КнигаУчетаДоходовИРасходов.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	КнигаУчетаДоходовИРасходов.Графа4 КАК СуммаПлатежа,
		|	КнигаУчетаДоходовИРасходов.ТипОплаты КАК ТипОплаты,
		|	КнигаУчетаДоходовИРасходов.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
		|ГДЕ
		|	КнигаУчетаДоходовИРасходов.Регистратор.ДоговорКонтрагента = &Договор
		|	И КнигаУчетаДоходовИРасходов.Активность
		|	И КнигаУчетаДоходовИРасходов.Графа4 <> 0
		|	";
		
		ЗапросОплаты.УстановитьПараметр("Контрагент", Покупатель);
		ЗапросОплаты.УстановитьПараметр("Договор",    ДоговорРеал);
		// Если хочешь фильтровать по конкретному ТипОплаты, раскомментируй строку в тексте
		// и добавь параметр:
		// ЗапросОплаты.УстановитьПараметр("ТипОплатыОплата", <нужное значение перечисления>);
		
		РезОплаты     = ЗапросОплаты.Выполнить();
		ВыборкаОплаты = РезОплаты.Выбрать();
		Пока ВыборкаОплаты.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаОплаты.СуммаПлатежа) 
				ИЛИ ВыборкаОплаты.СуммаПлатежа <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НСтрДС = Объект.ДенежныеСредства.Добавить();
			
			НСтрДС.ВидОтчетаПоПлатежам = Перечисления.ВидыОтчетовПоПлатежамКомиссия.Оплата;
			НСтрДС.Сумма               = ВыборкаОплаты.СуммаПлатежа;
			НСтрДС.СтавкаНДС           = Перечисления.СтавкиНДС.БезНДС;
			НСтрДС.СуммаНДС            = 0;
			НСтрДС.Покупатель          = ВыборкаОплаты.Контрагент;   // Справочник Контрагенты
			НСтрДС.ДатаСобытия         = ВыборкаОплаты.ДатаПлатежа;
			
			// При желании можно сохранить регистратор/комментарий
			// НСтрДС.ДокументОплаты = ВыборкаОплаты.Регистратор;
			
			ИзмененияЕсть        = Истина;
			ДобавленоПоДокументу = ДобавленоПоДокументу + 1;
			
		КонецЦикла;
		
	КонецЦикла; // Товары	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСубконто()
	Объект.Субконто = ЭТ_Общиймодуль2.ПолучитьНастройку("ОтчетКомитентаНоменклатурнаяГруппа");
КонецПроцедуры

&НаСервере
Процедура ЭТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.СчетУчетаНДСПоРеализации = ЭТ_Общиймодуль2.ПолучитьНастройку("РеализацияСчетУчетаНДСВУслугах");  
		Объект.СчетДоходов = ЭТ_Общиймодуль2.ПолучитьНастройку("ОтчетКомитентаСчетУчетаДоходов"); 
		Объект.УслугаПоВознаграждению = ЭТ_Общиймодуль2.ПолучитьНастройку("ОтчетКомитентаУслугаПоВознаграждению");		
	КонецЕсли;
	ПолеДоговорТО = Элементы.Добавить("ТоварыЭТ_ДоговорТО",Тип("ПолеФормы"),Элементы.Товары);
	ПолеДоговорТО.ПутьКДанным = "Объект.Товары.ЭТ_ДоговорТО";
	ПолеДоговорТО.Заголовок = "Договор ТО";
	ПолеДоговорТО.Видимость = Истина;
	ПолеДоговорТО.Вид = ВидПоляФормы.ПолеВвода;
	ПолеДоговорТО.Доступность = Истина;	
КонецПроцедуры

&НаСервере
Функция ПроверитьДоговорТО(Идентификатор)
	Результат = ПолучитьДоговорТО(ЭтотОбъект,Объект.Товары[Идентификатор]); 
	Возврат НЕ Результат=Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ЭТ_ДоговорТОНажатие(Элемент)
	Сообщить("ок");
КонецПроцедуры


Функция ПолучитьДоговорТО(Документ,Строка)
	КВозврату = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ТаблицаАУ = Строка.ДокументРасчетов.Метаданные().ТабличныеЧасти.Найти("АгентскиеУслуги");
	Если ТаблицаАУ <> Неопределено Тогда
		Если ТаблицаАУ.Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено И ТаблицаАУ.Реквизиты.Найти("Содержание") <> Неопределено Тогда			
			Для каждого СледУслуга Из Строка.ДокументРасчетов.АгентскиеУслуги Цикл
				Если ВРег(СтрЗаменить(СледУслуга.Содержание," ","")) = ВРег(СтрЗаменить(Строка.Содержание," ","")) Тогда
					КВозврату = СледУслуга.ДоговорКонтрагента;				
					Возврат КВозврату;
				КонецЕсли;			
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	Для Каждого СледБлок Из СтрРазделить(Строка.Содержание,",",Ложь) Цикл 
		Если ВероятностьНомера(СледБлок) Тогда    

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			               |ГДЕ
			               |	ДоговорыКонтрагентов.Владелец = &Владелец
			               |	И (СТРЗАМЕНИТЬ(ВРЕГ(ДоговорыКонтрагентов.НомерБрони), "" "", """") ПОДОБНО СТРЗАМЕНИТЬ(ВРЕГ(&СтрокаПоиска), "" "", """")
			               |			ИЛИ СТРЗАМЕНИТЬ(ВРЕГ(ДоговорыКонтрагентов.Наименование), "" "", """") ПОДОБНО СТРЗАМЕНИТЬ(ВРЕГ(&СтрокаПоиска), "" "", """"))";

			Запрос.УстановитьПараметр("Владелец", Документ.Контрагент);
			Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Врег(СтрЗаменить(СледБлок," ","")) + "%"); 
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				КВозврату = ВыборкаДетальныеЗаписи.Ссылка;		
				Возврат КВозврату;
			КонецЦикла;				
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			               |ГДЕ
			               |	ДоговорыКонтрагентов.Владелец = &Владелец
			               |	И (СТРЗАМЕНИТЬ(ВРЕГ(ДоговорыКонтрагентов.НомерБрони), "" "", """") ПОДОБНО СТРЗАМЕНИТЬ(ВРЕГ(&СтрокаПоиска), "" "", """")
			               |			ИЛИ СТРЗАМЕНИТЬ(ВРЕГ(ДоговорыКонтрагентов.Наименование), "" "", """") ПОДОБНО СТРЗАМЕНИТЬ(ВРЕГ(&СтрокаПоиска), "" "", """"))";

			Запрос.УстановитьПараметр("Владелец", Документ.Контрагент);
			ТекущийПрефикс = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс", "ЭТ18-");
			НомерЗаявки = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(СледБлок);
			Если НомерЗаявки>0 Тогда
				Запрос.УстановитьПараметр("СтрокаПоиска", "%" + Формат(НомерЗаявки,"ЧДЦ=0; ЧРД=; ЧРГ=; ЧН=; ЧГ=") + "%"); 
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					КВозврату = ВыборкаДетальныеЗаписи.Ссылка;		
					Возврат КВозврату;
				КонецЦикла;				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;   
	
	ТаблицаАУ = Строка.ДокументРасчетов.Метаданные().ТабличныеЧасти.Найти("АгентскиеУслуги");
	Если ТаблицаАУ <> Неопределено Тогда
		Если ТаблицаАУ.Реквизиты.Найти("ДоговорКонтрагента") <> Неопределено И ТаблицаАУ.Реквизиты.Найти("Содержание") <> Неопределено Тогда			
			Для каждого СледУслуга Из Строка.ДокументРасчетов.АгентскиеУслуги Цикл
				Если СледУслуга.Сумма = Строка.Сумма Тогда
					КВозврату = СледУслуга.ДоговорКонтрагента;				
					Возврат КВозврату;
				КонецЕсли;			
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	
		//НомерЗаявки = ЭТ_ОбщийМодуль2.ПолучитьНомерЗаявки(Строка.Содержание);
	Возврат КВозврату;		
КонецФункции        


Функция ВероятностьНомера(Строка)
    
    // Подсчет количества числовых символов в строке
    ЧисловыеСимволы = "";
    Для Инд = 1 По СтрДлина(Строка) Цикл
        Если Найти("0123456789", Сред(Строка, Инд, 1)) > 0 Тогда
            ЧисловыеСимволы = ЧисловыеСимволы + Сред(Строка, Инд, 1);
        КонецЕсли;
    КонецЦикла;
    
    // Проверяем количество числовых символов
    КоличествоЦифр = СтрДлина(ЧисловыеСимволы);
    Результат = (КоличествоЦифр >= 2);   // Возвращаем истину, если цифр две и больше

    Возврат Результат;
КонецФункции



//&НаКлиенте
//Процедура ЭТ_ТоварыПриИзмененииПосле(Элемент)
//    ТекущаяСтрока = Элемент.ТекущиеДанные;
//    Если  ТекущаяСтрока.ПолучитьИдентификатор()>=0 И ПроверитьДоговорТО(ТекущаяСтрока.ПолучитьИдентификатор()) Тогда
//        Элемент.ЦветФона = WebЦвета.СветлоКоралловый;
//    Иначе
//        Элемент.ЦветФона = WebЦвета.Белый;
//    КонецЕсли;
//КонецПроцедуры





&НаКлиенте
Процедура ЭТ_ЗаполнитьЗаПериодВместо(Команда)
	ЗначенияЗаполнения = Новый Структура("Организация,Контрагент", Объект.Организация,Объект.Контрагент);             
	Оп = Новый ОписаниеОповещения("ЭТ_ЗаполнитьТаблицу",ЭтотОбъект);
	ОткрытьФорму("Документ.ОтчетКомитентуОПродажах.Форма.ЭТ_ЗаполнитьЗаПериорд", ЗначенияЗаполнения,ЭтаФорма, Истина,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ЗаполнитьСубконто();
	ЭтаФорма.Элементы.Субконто.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура ЭТ_КонтрагентПриИзмененииПослеНаСервере()
	Объект.ДоговорКонтрагента = ПодобратьДоговорПоставщика(Объект.Контрагент, Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_КонтрагентПриИзмененииПосле(Элемент)
	ЭТ_КонтрагентПриИзмененииПослеНаСервере();
КонецПроцедуры

 &НаСервере
Функция ПодобратьДоговорПоставщика(Поставщик, Организация) Экспорт
	
	Перем ДоговорПоставщика;
	
	Если Не ЗначениеЗаполнено(Поставщик) Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	ДоговорПоставщика = ПолучитьОсновнойДоговорПоставщика(Поставщик, Организация);
	
	Если ЗначениеЗаполнено(ДоговорПоставщика) Тогда
		Возврат ДоговорПоставщика;
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
КонецФункции


&НаСервере
Функция ПолучитьОсновнойДоговорПоставщика(Поставщик, Организация)
	
	Если Не ЗначениеЗаполнено(Поставщик) Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	МассивВидовДоговоров = Новый Массив;
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СТранспортнойКомпанией);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
	
	ГоловнаяОрганизация = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	НЕ ОсновныеДоговорыКонтрагента.Договор ЕСТЬ NULL КАК Основной,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|		ПО ОсновныеДоговорыКонтрагента.Договор = ДоговорыКонтрагентов.Ссылка
	|			И ОсновныеДоговорыКонтрагента.Организация = ДоговорыКонтрагентов.Организация
	|			И ОсновныеДоговорыКонтрагента.Контрагент = ДоговорыКонтрагентов.Владелец
	|			И ОсновныеДоговорыКонтрагента.ВидДоговора = ДоговорыКонтрагентов.ВидДоговора
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Поставщик
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора В (&СписокВидовДоговоров)
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ДоговорЗакрыт = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основной УБЫВ,
	|	Приоритет УБЫВ";
	
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Запрос.УстановитьПараметр("Организация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("СписокВидовДоговоров", МассивВидовДоговоров);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.Основной Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Если Выборка.Количество() = 1 Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
КонецФункции
